#pragma once

#include	"TDNLIB.h"
#include	"BaseScene.h"

//*****************************************************************************
//		フレームワーク
//*****************************************************************************

//*****************************************************************************
//
//*****************************************************************************
#define	FPS_60_IEX		0	//	固定６０フレーム
#define	FPS_30_IEX		1	//	固定３０フレーム
#define	FPS_FLEX		2	//	可変フレーム

//*****************************************************************************
//
//*****************************************************************************

class Framework
{
private:
	//------------------------------------------------------
	//	初期化・解放
	//------------------------------------------------------
	Framework();
	~Framework();
	// 封印
	Framework(const Framework&) {}
	Framework& operator=(const Framework&) {}

public:
	//シングルトン
	static Framework* GetInstance();
	//  解放
	static void Release();

	//------------------------------------------------------
	//	更新・描画
	//------------------------------------------------------
	bool Update();
	void Render();

	//------------------------------------------------------
	//	シーンの切り替え
	//------------------------------------------------------
	void ChangeScene(BaseScene* newScene, bool bLoadingScene = false);

private:
	// 実体
	static Framework* m_pInstance;

	//------------------------------------------------------
	//	シーン
	//------------------------------------------------------
	BaseScene	*scene;

	//------------------------------------------------------
	//	更新
	//------------------------------------------------------
	BOOL	bRender;

	//------------------------------------------------------
	//	フレームレート関連
	//------------------------------------------------------
	DWORD	dwGameFrame;	//	起動からのフレーム数

	BYTE	FPSMode;		//	フレーム制御モード
	DWORD	dwFrameTime;

	DWORD	dwFPS;			//	処理フレームレート
	DWORD	dwRenderFPS;	//	描画フレームレート

	DWORD	dwCurFrame;		//	処理カウンタ
	DWORD	dwRCurFrame;	//	描画カウンタ

	bool movie_play = false; //	動画を再生しているかどうか
};

// インスタンス
#define MainFrameEX Framework::GetInstance()