#include	"iextreme.h"
#include	"system/system.h"
#include	"sceneMain.h"
#include "test/motion_blend_airou.h"
#include "text_loader/character_loader.h"

//*****************************************************************************************************************************
//
//	グローバル変数
//
//*****************************************************************************************************************************
//	カメラ用
iexView* view;
Vector3		cpos, ctarget;

//	ステージ用
iexMesh* lpStage = NULL;



TEST_airou *airou;


//*****************************************************************************************************************************
//
//	初期化
//
//*****************************************************************************************************************************
bool sceneMain::Initialize()
{
	//	環境設定
	iexLight::SetFog( 800, 1000, 0 );


	//	平行光設定							
	Vector3	 dir ( 1.0f, -1.0f, 1.0f );
	iexLight::DirLight ( 0, &dir, 1.0f, 1.0f, 1.0f );
	//	環境光設定							
	iexLight::SetAmbient ( 0x202020 );

	//	カメラ設定
	view = new iexView();
	view->Set( Vector3(0,10.0f,-20.0f), Vector3(0,0,0) );
	//	カメラ位置初期化							
	cpos.x = 40.0f;
	cpos.y = 10.0f;
	cpos.z = -40.0f;

	//	ステージ
	lpStage = new iexMesh("DATA\\BG\\STAGE\\STAGE01.X");

	airou = new TEST_airou;
	Character_loader loader;
	loader.Open("./DATA/character/airou/airou.txt");
	loader.Load(airou);
	loader.Close();

	return true;
}

sceneMain::~sceneMain()
{
	delete  lpStage;
	delete	view;

	delete airou;
}

//*****************************************************************************************************************************
//
//		更新
//
//*****************************************************************************************************************************

//	固定カメラ
void	 FixCamera( void )
{
	ctarget = Vector3( 0,0,0);
}

void	CameraUpdate( void )
{
	FixCamera();
	
	//	カメラ情報設定
	view ->Set( cpos, ctarget );
}


void	sceneMain::Update()
{
	CameraUpdate();

	airou->Update();
}

//*****************************************************************************************************************************
//
//		描画関連
//
//*****************************************************************************************************************************

void	sceneMain::Render()
{
	//	画面クリア
	view->Activate();
	view->Clear();

	//	ステージ
	lpStage->Render ();

	airou->Render();
}

//*****************************************************************************************************************************
//
//		その他
//
//*****************************************************************************************************************************




